tap "cmacrae/formulae"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "sambadevi/powerlevel9k"
tap "teamookla/speedtest"
tap "universal-ctags/universal-ctags"
# Run your GitHub Actions locally 🚀
brew "act"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text-based UI library
brew "ncurses"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc", link: false
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Improved top (interactive process viewer)
brew "htop"
# Generic library support script
brew "libtool"
# Simple terminal UI for git commands
brew "lazygit"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Simplistic interactive filtering tool
brew "peco"
# Cross-platform library for audio I/O
brew "portaudio"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
cask "font-hack-nerd-font"
# Open-source keystroke visualizer
cask "keycastr"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Development environment
cask "vagrant"
